{
    "comments": [
        "'input' denotes the file path to load the database from. If the file",
        "extention ends in '.pkl' then the format is assumed to be binary.",
        "CSV files are also supported and otherwise the file is assumed to be",
        "in the original dump_newest_only.txt format.",
        "",
        "'output' denotes the file path to save the new database in. Depending",
        "on the extension specified the output can be saved as either a CSV or",
        "pickle (binary) file for faster future reading.",
        "",
        "'related-char' decides whether to keep the related-char entry.",
        "",
        "'keep-stylized-variants' decides whether to keep italic, full/half",
        "width, sans, etc... variants.",
        "",
        "'filters' is a list of conditions each entry has to meet in order to",
        "be added to the new database. Dependencies of entries in the new",
        "database will always be added. Here are some of the filter options:",
        "   - 'fundamental': only keep characters that do not reference other",
        "       characters (does not include any '99' strokes). This is used",
        "       when other characters are going to be generated.",
        "   - 'cjk': Only keep the standard CJK Unified Ideographs. Enabling",
        "       this significantly reduces the number of entries saved.",
        "   - 'none': Keep nothing, overrides all other filters. This is used",
        "       alongside 'keep-chars' to create an exclusive list.",
        "",
        "'keep-chars' is a list of extra characters (in IDS form) to manually",
        "keep along with their dependenices.",
        "",
        "'static-overrides' is a set of entries to manually add/change in the",
        "database. Font-specific overrides will be applied at runtime."
    ],
    "input": "./dump_newest_only.pkl",
    "output": "./dump_reduced.csv",
    "related-char": false,
    "keep-stylized-variants": false,
    "filters": ["cjk", "none"],
    "keep-chars": ["u834a"],
    "static-overrides": {
    }
}
